invalid_input_button = \
    "Выбери, пожалуйста, один из предложенный вариантов ответа."

invalid_input_full_name = \
    "О-о-опс, кажется, это не похоже на ФИО :("

invalid_input_study_group = \
    "О-о-опс, кажется, это не похоже на код учебной группы :("

err_in_db           = \
    "Произошла ошибка при работе с базой данных, попробуйте повторить "\
    "действие или вернитесь к нему позднее."

blocked             = \
    "Вы заблокированы системой, по важным вопросам обращайтесь @unrelcy"

ticket_closed       = \
    "Это обращение уже закрыто"

undefined_behaviour = \
    "Не понимаю, что вы хотите сделать"

no_permission       = \
    "У нас нет доступа к этому функционалу"

no_func             = \
    "Функционал находится в разработке"

no_reply           = \
    "Чтобы ответить, отправьте сообщение ответом на одно из сообщений модератора"
