invalid_input_button = \
    "Выбери, пожалуйста, один из предложенный вариантов ответа."

invalid_input_full_name = \
    "❌️ Ошибка: ФИО должны содержать минимум два слова — имя и фамилию. Например: Иванов Иван."

invalid_input_study_group = \
    "⚠️ Номер группы введён некорректно. Укажи его в формате ИУ13-13Б."

err_in_db           = \
    "Произошла ошибка при работе с базой данных, попробуйте повторить "\
    "действие или вернитесь к нему позднее."

blocked             = \
    "Вы заблокированы системой, по важным вопросам обращайтесь @unrelcy"

ticket_closed       = \
    "Это обращение уже закрыто"

undefined_behaviour = \
    "🧐 Пожалуйста, выбери один из предложенных вариантов."

no_permission       = \
    "У нас нет доступа к этому функционалу"

no_func             = \
    "Функционал находится в разработке"

no_reply           = \
    "Чтобы ответить, отправьте сообщение ответом на одно из сообщений модератора"
