invalid_input_button = \
    "Выбери, пожалуйста, один из предложенный вариантов ответа."

invalid_input_full_name = \
    "❌️ Ошибка: ФИО должны содержать минимум два слова — имя и фамилию. Например: Иванов Иван."

invalid_input_study_group = \
    "⚠️ Номер группы введён некорректно. Укажи его в формате ИУ13-13Б."

undefined_behaviour = \
    "🧐 Пожалуйста, выбери один из предложенных вариантов."

processing_pd_is_required = \
    "❌️ К сожалению, чтобы продолжить пользоваться сервисом, необходимо дать согласие на обработку персональных данных."

no_reply = \
    "Чтобы ответить, отправьте сообщение ответом на одно из сообщений модератора"

unknown = \
    "Мы не понимаем, что вы хотите сделать :("

message_no_text = \
    "Данный тип сообщение не поддерживается, введите пожалуйста текст!"
